package com.javarush.task.task01.task0138;

/* 
Любимое стихотворение

В методе main напиши код, чтобы в результате выполнения программы было выведено твое любимое стихотворение.
В стихотворении должно быть не меньше, чем 4 строчки. Не убирай вывод строчки "Мое любимое стихотворение:".


Требования:
1. Программа должна выводить текст.
2. Перед стихом должна быть выведена строка "Мое любимое стихотворение:".
3. Выводимый текст должен состоять не меньше, чем из пяти строк (пустые строки - это тоже строки).
4. В выводимом тексте должно быть не менее, чем 50 символов.
*/

public class Solution {
    public static void main(String[] args) {
        System.out.println("Мое любимое стихотворение:\n" +
                "Я к вам пишу — чего же боле?\n" +
                "Что я могу ещё сказать?\n" +
                "Теперь, я знаю, в вашей воле\n" +
                "Меня презреньем наказать.");
        //напишите тут ваш код
    }
}